app/controllers/rooms_controller.rb

  def create
    @room = Room.new permitted_parameters

    if @room.save
---
INSERT INTO "rooms" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "first"], ["created_at", "2022-09-10 23:46:16.719873"], ["updated_at", "2022-09-10 23:46:16.719873"]]

  def load_entities
    @rooms = Room.all
    @room = Room.find(params[:id]) if params[:id]
---
SELECT "rooms".* FROM "rooms"
SELECT "rooms".* FROM "rooms" WHERE "rooms"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]